# Задача 1.
# Написать программу, которая запрашивает у пользователя
# произвольную строку и выводит на экран ее длину.

print("Длина строки:", len(input("Введите строку: ")))