# Задача 2.
# Написать программу, которая должна поочередно запросить у
# пользователя его ФИО и вывести результат в формате «Фамилия И. О.»

print(input("Введите фамилию: "), input("Введите имя: ")[0]+'.', input("Введите отчество: ")[0]+'.')